module bcd7seg(
  input  [3:0] b,
  output reg [6:0] h
);
  always @(*) begin
    case (b)
        4'b0000: h = 7'b0111111; // 0 - 显示数字0
        4'b0001: h = 7'b0000110; // 1 - 显示数字1
        4'b0010: h = 7'b1011011; // 2 - 显示数字2
        4'b0011: h = 7'b1001111; // 3 - 显示数字3
        4'b0100: h = 7'b1100110; // 4 - 显示数字4
        4'b0101: h = 7'b1101101; // 5 - 显示数字5
        4'b0110: h = 7'b1111101; // 6 - 显示数字6
        4'b0111: h = 7'b0000111; // 7 - 显示数字7
        4'b1000: h = 7'b1111111; // 8 - 显示数字8
        4'b1001: h = 7'b1101111; // 9 - 显示数字9

	default: h = 7'b0000000;
    endcase
  end

endmodule
